{
    "Python": {
        "description": "Язык программирования.",
        "content": "Python — это высокоуровневый язык программирования общего назначения..."
    },
    "JSON": {
        "description": "Формат обмена данными.",
        "content": "JSON (JavaScript Object Notation) — это текстовый формат обмена данными..."
    },
    "API": {
        "description": "Интерфейс программирования приложений.",
        "content": "API (Application Programming Interface) — это описание способов..."
    },
    "База данных": {
        "description": "Структурированный набор данных.",
        "content": "База данных — это организованная структура для хранения, изменения и обработки..."
    },
    "SQL": {
        "description": "Язык структурированных запросов.",
        "content": "SQL (Structured Query Language) используется для создания, изменения и управления данными..."
    },
    "HTTP": {
        "description": "Протокол передачи гипертекста.",
        "content": "HTTP (Hypertext Transfer Protocol) — это протокол прикладного уровня..."
    },
    "HTML": {
        "description": "Язык гипертекстовой разметки.",
        "content": "HTML (HyperText Markup Language) — это стандартизированный язык разметки документов..."
    },
    "CSS": {
        "description": "Каскадные таблицы стилей.",
        "content": "CSS (Cascading Style Sheets) используется для описания внешнего вида документа..."
    },
    "JavaScript": {
        "description": "Язык программирования для веб-страниц.",
        "content": "JavaScript — это мультипарадигменный язык программирования..."
    },
    "Git": {
        "description": "Система контроля версий.",
        "content": "Git — это распределённая система управления версиями..."
    },
    "Linux": {
        "description": "Семейство Unix-подобных операционных систем.",
        "content": "Linux — это ядро операционной системы..."
    },
    "Структуры данных": {
        "description": "Способы организации данных.",
        "content": "Структуры данных — это программная единица, позволяющая хранить и обрабатывать..."
    },
    "Объектно-ориентированное программирование": {
        "description": "Парадигма программирования.",
        "content": "ООП — это методология программирования, основанная на представлении программы..."
    },
    "Функциональное программирование": {
        "description": "Парадигма программирования.",
        "content": "Функциональное программирование — это раздел дискретной математики и парадигма программирования..."
    },
    "IT (Информационные технологии)": {
        "description": "Совокупность методов и средств для работы с информацией.",
        "content": "IT, также ИТ — это совокупность методов и средств для сбора, хранения, обработки и распространения информации. Название по-русски читается как «айти», что расшифровывается как информационные технологии. В сфере заняты разработчики, тестировщики, инженеры, администраторы, дизайнеры, аналитики и многие другие. Простыми словами IT-специалиста еще называют айтишником. Айтишники — специалисты в области информационных технологий (ИТ). Информационные технологии (ИТ) — это область, охватывающая разработку, внедрение и использование программного обеспечения, аппаратных средств и сетевых решений для эффективной обработки, хранения и передачи информации."
    },
    "Гаджет": {
        "description": "Техническое приспособление с повышенной функциональностью.",
        "content": "Гаджет (англ. gadget — принадлежность) это техническое приспособление (в том числе с цифровыми технологиями), обладающее повышенной функциональностью, но ограниченными возможностями (специализация). Важно не путать «гаджет» и «устройство» в классическом значении этих слов. Устройство же - предмет или инструмент, использующийся для выполнения определенной работы или/и достижения определенного результата."
    },
    "Сервер": {
        "description": "Сетевой компьютер для обработки запросов.",
        "content": "Сервер (от англ. server — обслуживающий) — сетевой компьютер, обрабатывающий запросы от других компьютеров в локальной или глобальной сети. Как правило, сервер выделен из всей группы компьютеров, подключенных к единой сети, работает автономно, без участия человека, за исключением первичной настройки. Он необходим для хранения данных и обслуживания запросов пользователей."
    },
    "Компьютер": {
        "description": "Электронное устройство для выполнения широкого круга задач.",
        "content": "Компьютер — это незаменимое устройство, которое стало неотъемлемой частью повседневной жизни. Это электронное устройство способно выполнять огромное количество задач, облегчая работу и ускоряя процессы во всех сферах деятельности. Он состоит из различных компонентов, таких как процессор, память, жесткий диск и другие устройства, которые выполняют различные операции."
    },
    "Компьютерная система": {
        "description": "Совокупность аппаратных и программных компонентов.",
        "content": "Компьютерная система — это совокупность аппаратных и программных компонентов, работающих вместе для выполнения определенных операций. Включает в себя процессор, память, устройства ввода/вывода и другие компоненты, которые выполняют вычисления и обрабатывают информацию."
    },
    "Операционная система (ОС)": {
        "description": "Программа, управляющая ресурсами компьютера.",
        "content": "Операционная система (ОС) — это программа, управляющая всеми аппаратными и программными ресурсами компьютера. ОС обеспечивает интерфейс между пользователем и аппаратным обеспечением, а также управляет выполнением других программ."
    },
    "Облачные вычисления": {
        "description": "Предоставление вычислительных ресурсов через интернет.",
        "content": "Облачные вычисления — это модель предоставления вычислительных ресурсов через интернет. Она позволяет пользователям использовать ресурсы, такие как серверы, хранилище данных и приложения, без необходимости их покупать и обслуживать."
    },
    "Искусственный интеллект (ИИ)": {
        "description": "Область наук о создании умных машин.",
        "content": "Искусственный интеллект (ИИ) — это область компьютерных наук, занимающаяся созданием умных машин, способных выполнять задачи, которые обычно требуют человеческого интеллекта. Это может включать обучение, распознавание речи, принятие решений и решение проблем."
    },
    "Виртуализация": {
        "description": "Создание виртуальных версий физических ресурсов.",
        "content": "Виртуализация — это технология, позволяющая создать виртуальные версии физических ресурсов, таких как серверы, хранилище данных или сети. Это позволяет эффективнее использовать вычислительные ресурсы и повышать гибкость."
    },
    "Интернет вещей (IoT)": {
        "description": "Концепция подключения устройств к интернету для обмена данными.",
        "content": "Интернет вещей (IoT) — это концепция, согласно которой различные устройства и объекты подключаются к интернету и могут обмениваться данными. Примеры: умные дома, носимые устройства, автомобили с автопилотом."
    },
    "Блокчейн": {
        "description": "Распределенная база данных в виде цепочки блоков.",
        "content": "Блокчейн — это распределенная база данных, в которой данные хранятся в виде блоков, связанных между собой в цепочку. Эта технология используется в криптовалютах и других приложениях, требующих высокой степени безопасности и прозрачности."
    },
    "Данные и их обработка": {
        "description": "Информация и операции для извлечения полезных сведений.",
        "content": "Данные — это информация, которая может быть собрана, хранится и обрабатывается с помощью компьютеров. Обработка данных включает в себя различные операции, такие как фильтрация, сортировка и анализ данных с целью извлечения полезной информации."
    },
    "Кибербезопасность": {
        "description": "Защита компьютерных систем и сетей от угроз.",
        "content": "Кибербезопасность — это защита компьютерных систем и сетей от различных угроз, таких как хакерские атаки, вирусы, кража данных и другие виды злоупотреблений."
    },
    "API (Application Programming Interface)": {
        "description": "Интерфейс для взаимодействия программ.",
        "content": "API (Application Programming Interface) — это интерфейс программирования приложений, который позволяет различным программам взаимодействовать между собой. API предоставляет функции и методы для выполнения определенных задач без необходимости вмешательства в код программы."
    },
    "Алгоритм": {
        "description": "Последовательность инструкций для выполнения задачи.",
        "content": "Алгоритм — это последовательность инструкций, которая приводит к выполнению конкретной задачи. В программировании алгоритмы являются основой для написания программ, определяя, как данные должны обрабатываться."
    }
}
